docs/uml/uml2/activity_calcul.puml
@startuml ActivityCalcul
start
:Identifier Etudiant et Matière;
:Récupérer les notes (CC, EXAM, RATTRAPAGE);

if (Rattrapage existe ?) then (Oui)
    :La note de rattrapage devient la moyenne;
else (Non)
    if (CC et EXAM existent ?) then (Oui)
        :Calculer (CC * 0.4) + (EXAM * 0.6);
    else (Une seule note)
        :La note disponible est la moyenne;
    endif
endif

:Appliquer pénalités d'absence (-0.01/h);
:Fixer la moyenne finale de la matière;
:Pousser vers le calcul de l'UE;
stop
@enduml
